nxp-mcuxpresso/mcux-devices-wireless/KW/KW43L43Z97/gcc/startup_KW43L43Z97.S
/* ------------------------------------------------------------------------- */
/*  @file:    startup_KW43L43Z97.s                                           */
/*  @purpose: CMSIS Cortex-M33 Core Device Startup File                      */
/*            KW43L43Z97                                                     */
/*  @version: 1.0                                                            */
/*  @date:    2020-5-12                                                      */
/*  @build:   b260421                                                        */
/* ------------------------------------------------------------------------- */
/*                                                                           */
/* Copyright 1997-2016 Freescale Semiconductor, Inc.                         */
/* Copyright 2016-2026 NXP                                                   */
/* SPDX-License-Identifier: BSD-3-Clause                                     */
/*****************************************************************************/
/* Version: GCC for ARM Embedded Processors                                  */
/*****************************************************************************/
    .syntax unified
    .arch armv8-m.main

    .section .isr_vector, "a"
    .align 2
    .globl __isr_vector
__isr_vector:
    .long   __StackTop                                      /* Top of Stack */
    .long   Reset_Handler                                   /* Reset Handler */
    .long   NMI_Handler                                     /* NMI Handler*/
    .long   HardFault_Handler                               /* Hard Fault Handler*/
    .long   MemManage_Handler                               /* MPU Fault Handler*/
    .long   BusFault_Handler                                /* Bus Fault Handler*/
    .long   UsageFault_Handler                              /* Usage Fault Handler*/
    .long   SecureFault_Handler                             /* Secure Fault Handler*/
    .long   0                                               /* Reserved*/
    .long   0                                               /* Reserved*/
    .long   0                                               /* Reserved*/
    .long   SVC_Handler                                     /* SVCall Handler*/
    .long   DebugMon_Handler                                /* Debug Monitor Handler*/
    .long   0                                               /* Reserved*/
    .long   PendSV_Handler                                  /* PendSV Handler*/
    .long   SysTick_Handler                                 /* SysTick Handler*/

                                                            /* External Interrupts*/
    .long   CTI_IRQHandler                                  /* Cross Trigger Interface interrupt*/
    .long   CMC0_IRQHandler                                 /* Core Mode Controller interrupt*/
    .long   DMA0_CH0_IRQHandler                             /* eDMA channel 0 error or transfer complete*/
    .long   DMA0_CH1_IRQHandler                             /* eDMA channel 1 error or transfer complete*/
    .long   DMA0_CH2_IRQHandler                             /* eDMA channel 2 error or transfer complete*/
    .long   DMA0_CH3_IRQHandler                             /* eDMA channel 3 error or transfer complete*/
    .long   DMA0_CH4_IRQHandler                             /* eDMA channel 4 error or transfer complete*/
    .long   DMA0_CH5_IRQHandler                             /* eDMA channel 5 error or transfer complete*/
    .long   DMA0_CH6_IRQHandler                             /* eDMA channel 6 error or transfer complete*/
    .long   DMA0_CH7_IRQHandler                             /* eDMA channel 7 error or transfer complete*/
    .long   DMA0_CH8_IRQHandler                             /* eDMA channel 8 error or transfer complete*/
    .long   DMA0_CH9_IRQHandler                             /* eDMA channel 9 error or transfer complete*/
    .long   DMA0_CH10_IRQHandler                            /* eDMA channel 10 error or transfer complete*/
    .long   DMA0_CH11_IRQHandler                            /* eDMA channel 11 error or transfer complete*/
    .long   DMA0_CH12_IRQHandler                            /* eDMA channel 12 error or transfer complete*/
    .long   DMA0_CH13_IRQHandler                            /* eDMA channel 13 error or transfer complete*/
    .long   DMA0_CH14_IRQHandler                            /* eDMA channel 14 error or transfer complete*/
    .long   DMA0_CH15_IRQHandler                            /* eDMA channel 15 error or transfer complete*/
    .long   EWM0_IRQHandler                                 /* External Watchdog Monitor interrupt*/
    .long   MCM0_IRQHandler                                 /* Miscellaneous Control Module0 interrupt*/
    .long   MSCM0_IRQHandler                                /* Miscellaneous System Control Module interrupt*/
    .long   SYSCON0_IRQHandler                              /* System control module*/
    .long   SECCON0_IRQHandler                              /* Secure System control module*/
    .long   SPC0_IRQHandler                                 /* System Power Controller 0 interrupt*/
    .long   WUU0_IRQHandler                                 /* Wake-Up Unit 0 interrupt*/
    .long   WDOG0_IRQHandler                                /* Watchdog Timer 0 interrupt*/
    .long   WDOG1_IRQHandler                                /* Watchdog Timer 1 interrupt*/
    .long   CDOG0_IRQHandler                                /* Code watchdog 0 interrupt*/
    .long   CDOG1_IRQHandler                                /* Code watchdog 1 interrupt*/
    .long   SCG0_IRQHandler                                 /* System Clock Generator 0 interrupt*/
    .long   SFA0_IRQHandler                                 /* Signal Frequency Analyzer 0 interrupt*/
    .long   FMU0_IRQHandler                                 /* Flash Memory Unit 0 interrupt*/
    .long   SFA1_IRQHandler                                 /* SFA interrupt for FRO-200M calibration*/
    .long   DSB0_IRQHandler                                 /* Data Stream Buffer*/
    .long   TRDC0_IRQHandler                                /* Trusted Resource Domain Controller 0 interrupt*/
    .long   RTC_Alarm_IRQHandler                            /* Real Time Clock 0 alarm interrupt*/
    .long   RTC_Seconds_IRQHandler                          /* Real Time Clock 0 seconds interrupt*/
    .long   LPTMR0_IRQHandler                               /* Low-Power Timer0 interrupt*/
    .long   LPTMR1_IRQHandler                               /* Low-Power Timer1 interrupt*/
    .long   LPIT0_IRQHandler                                /* Low-Power Periodic Interrupt Timer 0 interrupt*/
    .long   TPM_0_IRQHandler                                /* Timer / PWM Module 0 interrupt*/
    .long   TPM_1_IRQHandler                                /* Timer / PWM Module 1 interrupt*/
    .long   TPM_2_IRQHandler                                /* Timer / PWM Module 2 interrupt*/
    .long   TPM_3_IRQHandler                                /* Timer / PWM Module 3 interrupt*/
    .long   TPM_4_IRQHandler                                /* Timer / PWM Module 4 interrupt*/
    .long   MU1_IRQHandler                                  /* Interrupt from MU1/DSP-V lite*/
    .long   SYSCON0_ECC_IRQHandler                          /* SRAM ECC Error interrupt*/
    .long   LPI2C0_IRQHandler                               /* Low-Power Inter Integrated Circuit 0 interrupt*/
    .long   LPI2C1_IRQHandler                               /* Low-Power Inter Integrated Circuit 1 interrupt*/
    .long   LPSPI0_IRQHandler                               /* Low-Power Serial Peripheral Interface 0 interrupt*/
    .long   LPSPI1_IRQHandler                               /* Low-Power Serial Peripheral Interface 1 interrupt*/
    .long   LPSPI2_IRQHandler                               /* Low-Power Serial Peripheral Interface 2 interrupt*/
    .long   LPUART0_IRQHandler                              /* Low-Power Universal Asynchronous Receiver/Transmitter 0 interrupt*/
    .long   LPUART1_IRQHandler                              /* Low-Power Universal Asynchronous Receiver/Transmitter 1 interrupt*/
    .long   CAN0_IRQHandler                                 /* Controller Area Network 0 interrupt*/
    .long   RF_ZIGBEE_IRQHandler                            /* Zigbee Mac controller*/
    .long   RF_Generic_IRQHandler                           /* Generic Link Layer interrupt*/
    .long   RF_BRIC_IRQHandler                              /* Baix Radio Crypto*/
    .long   RF_LCL_IRQHandler                               /* Localization control*/
    .long   RF_WOR_IRQHandler                               /* Wake on radio*/
    .long   RFMC_IRQHandler                                 /* RFMC interrupt*/
    .long   Reserved77_IRQHandler                           /* xxx Interrupt 77*/
    .long   Reserved78_IRQHandler                           /* xxx Interrupt 78*/
    .long   COEX_INT_IRQHandler                             /* COEX_INT_IRQn*/
    .long   Reserved80_IRQHandler                           /* xxx Interrupt 80*/
    .long   GPIOA_INT0_IRQHandler                           /* General Purpose Input/Output A interrupt 0*/
    .long   GPIOA_INT1_IRQHandler                           /* General Purpose Input/Output A interrupt 1*/
    .long   GPIOB_INT0_IRQHandler                           /* General Purpose Input/Output B interrupt 0*/
    .long   GPIOB_INT1_IRQHandler                           /* General Purpose Input/Output B interrupt 1*/
    .long   GPIOC_INT0_IRQHandler                           /* General Purpose Input/Output C interrupt 0*/
    .long   GPIOC_INT1_IRQHandler                           /* General Purpose Input/Output C interrupt 1*/
    .long   GPIOD_INT0_IRQHandler                           /* General Purpose Input/Output D interrupt 0*/
    .long   GPIOD_INT1_IRQHandler                           /* General Purpose Input/Output D interrupt 1*/
    .long   Reserved89_IRQHandler                           /* xxx Interrupt 89*/
    .long   Reserved90_IRQHandler                           /* xxx Interrupt 90*/
    .long   Reserved91_IRQHandler                           /* xxx Interrupt 91*/
    .long   Reserved92_IRQHandler                           /* xxx Interrupt 92*/
    .long   ADC0_IRQHandler                                 /* Analog-to-Digital Converter - General Purpose0 interrupt*/
    .long   CMP0_IRQHandler                                 /* Comparator - General Purpose0 interrupt*/
    .long   FLEXPWM0_SUBMODULE0_CMP_IRQHandler              /* PWM_CMP0: Submodule 0 compare interrupt*/
    .long   FLEXPWM0_SUBMODULE0_CAP_IRQHandler              /* PWM_CAP0: Submodule 0 input capture interrupt*/
    .long   FLEXPWM0_SUBMODULE0_RELOAD_IRQHandler           /* PWM_RELOAD0: Submodule 0 Reload interrupt*/
    .long   FLEXPWM0_SUBMODULE1_CMP_IRQHandler              /* PWM_CMP1: Submodule 1 compare interrupt*/
    .long   FLEXPWM0_SUBMODULE1_CAP_IRQHandler              /* PWM_CAP1: Submodule 1 input capture interrupt*/
    .long   FLEXPWM0_SUBMODULE1_RELOAD_IRQHandler           /* PWM_RELOAD1: Submodule 1 Reload interrupt*/
    .long   FLEXPWM0_SUBMODULE2_CMP_IRQHandler              /* PWM_CMP2: Submodule 2 compare interrupt*/
    .long   FLEXPWM0_SUBMODULE2_CAP_IRQHandler              /* PWM_CAP2: Submodule 2 input capture interrupt*/
    .long   FLEXPWM0_SUBMODULE2_RELOAD_IRQHandler           /* PWM_RELOAD2: Submodule 2 Reload interrupt*/
    .long   FLEXPWM0_RELOAD_ERROR_IRQHandler                /* PWM_RERR: Reload Error interrupt*/
    .long   FLEXPWM0_FAULT_IRQHandler                       /* PWM_FAULT: PWM fault input interrupt*/
    .long   ITRC_IRQHandler                                 /* Output of Intrusion and tamper response controller (ITRC_IRQ)*/
    .long   TDET_IRQHandler                                 /* Tamper detection interrupt*/
    .long   MU0_IRQHandler                                  /* Interrupt from MU0 to CPU0*/
    .long   INTM_IRQHandler                                 /* Error flag to show Radio interrrupt is not serviced in time*/
    .long   SGI_IRQHandler                                  /* SGI Interrupt*/
    .long   SECURE_ERR_IRQHandler                           /* Secure IP Error Interrupt*/
    .long   PKC_IRQHandler                                  /* PKC Module Error*/
    .long   TRNG0_IRQHandler                                /* TRNG Module Error*/
    .long   FLASH_Arbiter_IRQHandler                        /* Combined interrupt from Flash Arbiter */
    .long   BLE_INT0_IRQHandler                             /* BLE LL interrupt Set 0 (BLE_INT0_IRQn)*/
    .long   BLE_INT1_IRQHandler                             /* BLE LL interrupt Set 1 (BLE_INT1_IRQn)*/
    .long   BLE_INT2_IRQHandler                             /* BLE LL interrupt Set 2 (BLE_INT2_IRQn)*/
    .long   BRF_INT_IRQHandler                              /* BLE LL/ BTRFIRQ (BRF_INT_IRQn)*/
    .long   T1_INT_IRQHandler                               /* BLE LL / RTU 1 (T1_INT_IRQn)*/
    .long   T2_INT_IRQHandler                               /* BLE LL / RTU 2 (T2_INT_IRQn)*/
    .long   T3_INT_IRQHandler                               /* BLE LL / RTU 3 (T3_INT_IRQn)*/
    .long   T4_INT_IRQHandler                               /* BLE LL / RTU 4 (T4_INT_IRQn)*/
    .long   WDG1_IRQHandler                                 /* BLE LL / RTU 5 (WDG1_INT_IRQn)*/
    .long   OSC_32M_READY_IRQHandler                        /* 32M Crystal OSC ready interrupt*/
    .long   RBME_INT_IRQHandler                             /* Radio Bit Manipulation Engine (RBME_INT_IRQn)*/
    .long   RSM_INT_IRQHandler                              /* Ranging State Machine (RSM_INT_IRQn)*/
    .long   PLL_ABORT_INT_IRQHandler                        /* PLL control (PLL_ABORT_INT_IRQn)*/
    .long   DMA_LIGHT_IRQHandler                            /* DMA light*/
    .long   DefaultISR                                      /* 129*/
    .long   DefaultISR                                      /* 130*/
    .long   DefaultISR                                      /* 131*/
    .long   DefaultISR                                      /* 132*/
    .long   DefaultISR                                      /* 133*/
    .long   DefaultISR                                      /* 134*/
    .long   DefaultISR                                      /* 135*/
    .long   DefaultISR                                      /* 136*/
    .long   DefaultISR                                      /* 137*/
    .long   DefaultISR                                      /* 138*/
    .long   DefaultISR                                      /* 139*/
    .long   DefaultISR                                      /* 140*/
    .long   DefaultISR                                      /* 141*/
    .long   DefaultISR                                      /* 142*/
    .long   DefaultISR                                      /* 143*/
    .long   DefaultISR                                      /* 144*/
    .long   DefaultISR                                      /* 145*/
    .long   DefaultISR                                      /* 146*/
    .long   DefaultISR                                      /* 147*/
    .long   DefaultISR                                      /* 148*/
    .long   DefaultISR                                      /* 149*/
    .long   DefaultISR                                      /* 150*/
    .long   DefaultISR                                      /* 151*/
    .long   DefaultISR                                      /* 152*/
    .long   DefaultISR                                      /* 153*/
    .long   DefaultISR                                      /* 154*/
    .long   DefaultISR                                      /* 155*/
    .long   DefaultISR                                      /* 156*/
    .long   DefaultISR                                      /* 157*/
    .long   DefaultISR                                      /* 158*/
    .long   DefaultISR                                      /* 159*/
    .long   DefaultISR                                      /* 160*/
    .long   DefaultISR                                      /* 161*/
    .long   DefaultISR                                      /* 162*/
    .long   DefaultISR                                      /* 163*/
    .long   DefaultISR                                      /* 164*/
    .long   DefaultISR                                      /* 165*/
    .long   DefaultISR                                      /* 166*/
    .long   DefaultISR                                      /* 167*/
    .long   DefaultISR                                      /* 168*/
    .long   DefaultISR                                      /* 169*/
    .long   DefaultISR                                      /* 170*/
    .long   DefaultISR                                      /* 171*/
    .long   DefaultISR                                      /* 172*/
    .long   DefaultISR                                      /* 173*/
    .long   DefaultISR                                      /* 174*/
    .long   DefaultISR                                      /* 175*/
    .long   DefaultISR                                      /* 176*/
    .long   DefaultISR                                      /* 177*/
    .long   DefaultISR                                      /* 178*/
    .long   DefaultISR                                      /* 179*/
    .long   DefaultISR                                      /* 180*/
    .long   DefaultISR                                      /* 181*/
    .long   DefaultISR                                      /* 182*/
    .long   DefaultISR                                      /* 183*/
    .long   DefaultISR                                      /* 184*/
    .long   DefaultISR                                      /* 185*/
    .long   DefaultISR                                      /* 186*/
    .long   DefaultISR                                      /* 187*/
    .long   DefaultISR                                      /* 188*/
    .long   DefaultISR                                      /* 189*/
    .long   DefaultISR                                      /* 190*/
    .long   DefaultISR                                      /* 191*/
    .long   DefaultISR                                      /* 192*/
    .long   DefaultISR                                      /* 193*/
    .long   DefaultISR                                      /* 194*/
    .long   DefaultISR                                      /* 195*/
    .long   DefaultISR                                      /* 196*/
    .long   DefaultISR                                      /* 197*/
    .long   DefaultISR                                      /* 198*/
    .long   DefaultISR                                      /* 199*/
    .long   DefaultISR                                      /* 200*/
    .long   DefaultISR                                      /* 201*/
    .long   DefaultISR                                      /* 202*/
    .long   DefaultISR                                      /* 203*/
    .long   DefaultISR                                      /* 204*/
    .long   DefaultISR                                      /* 205*/
    .long   DefaultISR                                      /* 206*/
    .long   DefaultISR                                      /* 207*/
    .long   DefaultISR                                      /* 208*/
    .long   DefaultISR                                      /* 209*/
    .long   DefaultISR                                      /* 210*/
    .long   DefaultISR                                      /* 211*/
    .long   DefaultISR                                      /* 212*/
    .long   DefaultISR                                      /* 213*/
    .long   DefaultISR                                      /* 214*/
    .long   DefaultISR                                      /* 215*/
    .long   DefaultISR                                      /* 216*/
    .long   DefaultISR                                      /* 217*/
    .long   DefaultISR                                      /* 218*/
    .long   DefaultISR                                      /* 219*/
    .long   DefaultISR                                      /* 220*/
    .long   DefaultISR                                      /* 221*/
    .long   DefaultISR                                      /* 222*/
    .long   DefaultISR                                      /* 223*/
    .long   DefaultISR                                      /* 224*/
    .long   DefaultISR                                      /* 225*/
    .long   DefaultISR                                      /* 226*/
    .long   DefaultISR                                      /* 227*/
    .long   DefaultISR                                      /* 228*/
    .long   DefaultISR                                      /* 229*/
    .long   DefaultISR                                      /* 230*/
    .long   DefaultISR                                      /* 231*/
    .long   DefaultISR                                      /* 232*/
    .long   DefaultISR                                      /* 233*/
    .long   DefaultISR                                      /* 234*/
    .long   DefaultISR                                      /* 235*/
    .long   DefaultISR                                      /* 236*/
    .long   DefaultISR                                      /* 237*/
    .long   DefaultISR                                      /* 238*/
    .long   DefaultISR                                      /* 239*/
    .long   DefaultISR                                      /* 240*/
    .long   DefaultISR                                      /* 241*/
    .long   DefaultISR                                      /* 242*/
    .long   DefaultISR                                      /* 243*/
    .long   DefaultISR                                      /* 244*/
    .long   DefaultISR                                      /* 245*/
    .long   DefaultISR                                      /* 246*/
    .long   DefaultISR                                      /* 247*/
    .long   DefaultISR                                      /* 248*/
    .long   DefaultISR                                      /* 249*/
    .long   DefaultISR                                      /* 250*/
    .long   DefaultISR                                      /* 251*/
    .long   DefaultISR                                      /* 252*/
    .long   DefaultISR                                      /* 253*/
    .long   DefaultISR                                      /* 254*/
    .long   DefaultISR                                      /* 255*/

    .size    __isr_vector, . - __isr_vector

    .text
    .thumb

